In [1]:
#(A)  Applied Statistics
import pandas as pd
import numpy as np

In [2]:
#Ex1. For a given set of values in stats.xls that contains the list of employees, years of experience and their salary 
#     write a python script to calculate the 	mean, 	mode and median. 

df = pd.read_csv('E:/ML/AI ML docs/Stats.csv')

In [3]:
df

    Emp#  YearsOfExp  Salary in Rs.
0      1          10         126015
1      2           1          12598
2      3           8         100639
3      4          10         125351
4      5           2          25031
5      6           5          62630
6      7           9         112620
7      8           8         100639
8      9           4          50145
9     10           2          25232
10    11           9         112770
11    12           3          37512
12    13           4          50274
13    14           5          62768
14    15          10         125363
15    16           2          25226
16    17           6          75392
17    18           7          87779
18    19           7          87654
19    20           3          37592
20    21          10         125186
21    22           2          25187
22    23           9         113309
23    24           9         113112
24    25          10         125506

In [4]:
df.isnull().sum()

Emp#             0
YearsOfExp       0
Salary in Rs.    0
dtype: int64

In [5]:
# mean,mode and median on Employee salary
x=(df['Salary in Rs.']) # Salary assigned to x variable
y=(df['YearsOfExp'])

In [6]:
# x is contain the salary
x

0     126015
1      12598
2     100639
3     125351
4      25031
5      62630
6     112620
7     100639
8      50145
9      25232
10    112770
11     37512
12     50274
13     62768
14    125363
15     25226
16     75392
17     87779
18     87654
19     37592
20    125186
21     25187
22    113309
23    113112
24    125506
Name: Salary in Rs., dtype: int64

In [7]:
# a) Mean of the salary 
A = x.mean()
print(A)

77821.2

In [8]:
# b) Mode of the salary 
B = x.mode()
print(B)

0    100639
dtype: int64

In [9]:
# c) Median of the salary 
C = x.median()
print(C)

87654.0

In [10]:
y

0     10
1      1
2      8
3     10
4      2
5      5
6      9
7      8
8      4
9      2
10     9
11     3
12     4
13     5
14    10
15     2
16     6
17     7
18     7
19     3
20    10
21     2
22     9
23     9
24    10
Name: YearsOfExp, dtype: int64

In [11]:
# a) Mean of the yearsOfExp 
D = x.mean()
print(D)

77821.2

In [12]:
# e) Mode of the yearsOfExp
E = x.mode()
print(E)

0    100639
dtype: int64

In [13]:

# f) Medianof the yearsOfExp
F = y.median()
print(F)

7.0

In [14]:
#

In [15]:
# Ex2. For the above exercise determine the standard deviation and 
# variance through python scripting
df.head()

   Emp#  YearsOfExp  Salary in Rs.
0     1          10         126015
1     2           1          12598
2     3           8         100639
3     4          10         125351
4     5           2          25031

In [16]:
P= (df['Salary in Rs.'])

In [17]:
P.head()

0    126015
1     12598
2    100639
3    125351
4     25031
Name: Salary in Rs., dtype: int64

In [18]:
s=P.std()

In [19]:
s

39847.6152810094

In [23]:
#B = Std.var()

In [22]:
df.describe()

            Emp#  YearsOfExp  Salary in Rs.
count  25.000000   25.000000      25.000000
mean   13.000000    6.200000   77821.200000
std     7.359801    3.175426   39847.615281
min     1.000000    1.000000   12598.000000
25%     7.000000    3.000000   37592.000000
50%    13.000000    7.000000   87654.000000
75%    19.000000    9.000000  113112.000000
max    25.000000   10.000000  126015.000000